SFD_FLAMELET_JETTURB_PILBULK/0/Z
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Z;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    axis
    {
        type            zeroGradient;
    }
    fuel
    {
        type            fixedValue;
        value           uniform 1.0;
    }
    pilot
    {
        type            fixedValue;
        value           uniform 0.271;
    }
    coflow
    {
        type            fixedValue;
        value           uniform 0;
    }
    inletwall
    {
        type            zeroGradient;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    front
    {
        type            zeroGradient;
    }
    back
    {
        type            zeroGradient;
    }
    atmosphere
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
